#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_app_service.app_service will be created
  + resource "azurerm_app_service" "app_service" {
      + app_service_plan_id            = (known after apply)
      + app_settings                   = (known after apply)
      + client_affinity_enabled        = (known after apply)
      + default_site_hostname          = (known after apply)
      + enabled                        = true
      + https_only                     = false
      + id                             = (known after apply)
      + location                       = "canadacentral"
      + name                           = "EsDCCPPDappservice"
      + outbound_ip_addresses          = (known after apply)
      + possible_outbound_ip_addresses = (known after apply)
      + resource_group_name            = "EsDCCPPDrg"
      + site_credential                = (known after apply)
      + source_control                 = (known after apply)
      + tags                           = {
          + "Branch"         = "IITB"
          + "Classification" = "Unclassified"
          + "CsdId"          = "930"
          + "Directorate"    = "BSIM"
          + "Environment"    = "Sandbox"
          + "Project"        = "DTS"
          + "ServiceOwner"   = "calvin.rodo@014gc.microsoftonline.com"
        }

      + auth_settings {
          + additional_login_params        = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + logs {
          + application_logs {
              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          + http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              + file_system {
                  + retention_in_days = (known after apply)
                  + retention_in_mb   = (known after apply)
                }
            }
        }

      + site_config {
          + always_on                = true
          + dotnet_framework_version = "v4.0"
          + ftps_state               = (known after apply)
          + http2_enabled            = true
          + ip_restriction           = (known after apply)
          + linux_fx_version         = (known after apply)
          + local_mysql_enabled      = (known after apply)
          + managed_pipeline_mode    = (known after apply)
          + min_tls_version          = (known after apply)
          + remote_debugging_enabled = false
          + remote_debugging_version = (known after apply)
          + scm_type                 = "None"
          + websockets_enabled       = (known after apply)
          + windows_fx_version       = (known after apply)

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = (known after apply)
            }
        }

      + storage_account {
          + access_key   = (sensitive value)
          + account_name = (known after apply)
          + mount_path   = (known after apply)
          + name         = (known after apply)
          + share_name   = (known after apply)
          + type         = (known after apply)
        }
    }

  # azurerm_app_service_plan.app_service_plan will be created
  + resource "azurerm_app_service_plan" "app_service_plan" {
      + app_service_environment_id   = (known after apply)
      + id                           = (known after apply)
      + kind                         = "Linux"
      + location                     = "canadacentral"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "EsDCCPPDasp"
      + per_site_scaling             = (known after apply)
      + reserved                     = true
      + resource_group_name          = "EsDCCPPDrg"
      + tags                         = {
          + "Branch"         = "IITB"
          + "Classification" = "Unclassified"
          + "CsdId"          = "930"
          + "Directorate"    = "BSIM"
          + "Environment"    = "Sandbox"
          + "Project"        = "DTS"
          + "ServiceOwner"   = "calvin.rodo@014gc.microsoftonline.com"
        }

      + properties {
          + app_service_environment_id = (known after apply)
          + per_site_scaling           = (known after apply)
          + reserved                   = (known after apply)
        }

      + sku {
          + capacity = (known after apply)
          + size     = "B1"
          + tier     = "Standard"
        }
    }

  # azurerm_container_registry.container_registry will be created
  + resource "azurerm_container_registry" "container_registry" {
      + admin_enabled       = true
      + admin_password      = (sensitive value)
      + admin_username      = (known after apply)
      + id                  = (known after apply)
      + location            = "canadacentral"
      + login_server        = (known after apply)
      + name                = "EsDCCPPDr"
      + network_rule_set    = (known after apply)
      + resource_group_name = "EsDCCPPDrg"
      + sku                 = "Standard"
      + tags                = {
          + "Branch"         = "IITB"
          + "Classification" = "Unclassified"
          + "CsdId"          = "930"
          + "Directorate"    = "BSIM"
          + "Environment"    = "Sandbox"
          + "Project"        = "DTS"
          + "ServiceOwner"   = "calvin.rodo@014gc.microsoftonline.com"
        }
    }

  # azurerm_postgresql_database.postgres will be created
  + resource "azurerm_postgresql_database" "postgres" {
      + charset             = "UTF8"
      + collation           = "English_United States.1252"
      + id                  = (known after apply)
      + name                = "exampledb"
      + resource_group_name = "EsDCCPPDrg"
      + server_name         = "cppd-postgresql-server"
    }

  # azurerm_postgresql_server.postgres will be created
  + resource "azurerm_postgresql_server" "postgres" {
      + administrator_login          = "foo"
      + administrator_login_password = (sensitive value)
      + fqdn                         = (known after apply)
      + id                           = (known after apply)
      + location                     = "canadacentral"
      + name                         = "cppd-postgresql-server"
      + resource_group_name          = "EsDCCPPDrg"
      + sku_name                     = "B_Gen5_2"
      + ssl_enforcement              = "Enabled"
      + tags                         = {
          + "Branch"         = "IITB"
          + "Classification" = "Unclassified"
          + "CsdId"          = "930"
          + "Directorate"    = "BSIM"
          + "Environment"    = "Sandbox"
          + "Project"        = "DTS"
          + "ServiceOwner"   = "calvin.rodo@014gc.microsoftonline.com"
        }
      + version                      = "11"

      + sku {
          + capacity = (known after apply)
          + family   = (known after apply)
          + name     = (known after apply)
          + tier     = (known after apply)
        }

      + storage_profile {
          + auto_grow             = "Disabled"
          + backup_retention_days = 7
          + geo_redundant_backup  = "Disabled"
          + storage_mb            = 5120
        }
    }

  # azurerm_redis_cache.session_store will be created
  + resource "azurerm_redis_cache" "session_store" {
      + capacity                  = 2
      + enable_non_ssl_port       = false
      + family                    = "C"
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + location                  = "canadacentral"
      + minimum_tls_version       = "1.2"
      + name                      = "example-cache"
      + port                      = (known after apply)
      + primary_access_key        = (sensitive value)
      + private_static_ip_address = (known after apply)
      + resource_group_name       = "EsDCCPPDrg"
      + secondary_access_key      = (sensitive value)
      + sku_name                  = "Standard"
      + ssl_port                  = (known after apply)
      + tags                      = {
          + "Branch"         = "IITB"
          + "Classification" = "Unclassified"
          + "CsdId"          = "930"
          + "Directorate"    = "BSIM"
          + "Environment"    = "Sandbox"
          + "Project"        = "DTS"
          + "ServiceOwner"   = "calvin.rodo@014gc.microsoftonline.com"
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = (known after apply)
          + maxmemory_delta                 = (known after apply)
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = (known after apply)
        }
    }

  # azurerm_resource_group.resource_group will be created
  + resource "azurerm_resource_group" "resource_group" {
      + id       = (known after apply)
      + location = "canadacentral"
      + name     = "EsDCCPPDrg"
      + tags     = {
          + "Branch"         = "IITB"
          + "Classification" = "Unclassified"
          + "CsdId"          = "930"
          + "Directorate"    = "BSIM"
          + "Environment"    = "Sandbox"
          + "Project"        = "DTS"
          + "ServiceOwner"   = "calvin.rodo@014gc.microsoftonline.com"
        }
    }

  # azurerm_storage_account.file_upload will be created
  + resource "azurerm_storage_account" "file_upload" {
      + access_tier                       = (known after apply)
      + account_encryption_source         = "Microsoft.Storage"
      + account_kind                      = "Storage"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + account_type                      = (known after apply)
      + enable_advanced_threat_protection = (known after apply)
      + enable_blob_encryption            = true
      + enable_file_encryption            = true
      + id                                = (known after apply)
      + is_hns_enabled                    = false
      + location                          = "canadacentral"
      + name                              = "cppdfileupload"
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + resource_group_name               = "EsDCCPPDrg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + tags                              = {
          + "Branch"         = "IITB"
          + "Classification" = "Unclassified"
          + "CsdId"          = "930"
          + "Directorate"    = "BSIM"
          + "Environment"    = "Sandbox"
          + "Project"        = "DTS"
          + "ServiceOwner"   = "calvin.rodo@014gc.microsoftonline.com"
        }

      + blob_properties {
          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }
    }

  # azurerm_storage_container.example will be created
  + resource "azurerm_storage_container" "example" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "vhds"
      + properties              = (known after apply)
      + resource_group_name     = (known after apply)
      + storage_account_name    = "cppdfileupload"
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `OpenPolicyAgent Compliance Checks`, Action: `run3`*
